[
    { 
        "_id": "A101", 
        "title": "Propulsion Assignment", 
        "availability": "2024-10-01", 
        "due": "2024-10-15", 
        "points": "100",
        "course": "RS101",
        "description": "This assignment covers the principles of propulsion systems, including rocket engines and jet engines. You will be expected to analyze thrust equations and calculate fuel efficiency for various propulsion systems."
    },
    { 
        "_id": "A102", 
        "title": "Combustion Analysis", 
        "availability": "2024-10-05", 
        "due": "2024-10-20", 
        "points": "100",
        "course": "RS101",
        "description": "In this assignment, you will study the combustion process in engines, focusing on fuel types and efficiency. The task includes creating models for heat release and combustion rates."
    },
    { 
        "_id": "A103", 
        "title": "Nozzle Design Project", 
        "availability": "2024-10-10", 
        "due": "2024-10-25",
        "points": "100",
        "course": "RS101",
        "description": "This project will require you to design an efficient nozzle for high-speed exhaust flow. You will evaluate design parameters like nozzle contour, exit pressure, and expansion ratios."
    },
    { 
        "_id": "A201", 
        "title": "Aerodynamics Quiz", 
        "availability": "2024-10-02", 
        "due": "2024-10-16", 
        "points": "100",
        "course": "RS102",
        "description": "This quiz will test your understanding of aerodynamic principles including lift, drag, and flow behavior around various shapes. Be prepared for both multiple-choice and short-answer questions."
    },
    { 
        "_id": "A202", 
        "title": "Flow Analysis", 
        "availability": "2024-10-03", 
        "due": "2024-10-17", 
        "points": "100",
        "course": "RS102",
        "description": "In this assignment, you will analyze fluid flow in different configurations. Topics include laminar and turbulent flows, boundary layers, and flow separation."
    },
    { 
        "_id": "A203", 
        "title": "Heating Analysis", 
        "availability": "2024-10-04", 
        "due": "2024-10-18", 
        "points": "100",
        "course": "RS102",
        "description": "This assignment focuses on heat transfer in engineering systems. You will calculate heat flux, analyze thermal gradients, and determine heat exchanger performance."
    },
    { 
        "_id": "A301", 
        "title": "Structural Design Task", 
        "availability": "2024-10-05", 
        "due": "2024-10-22", 
        "points": "100",
        "course": "RS103",
        "description": "You will be tasked with designing a lightweight, load-bearing structure for aerospace applications. The design should maximize strength-to-weight ratio while adhering to safety standards."
    },
    { 
        "_id": "A302", 
        "title": "Orbital Calculations", 
        "availability": "2024-10-07", 
        "due": "2024-10-24",
        "points": "100", 
        "course": "RS103",
        "description": "This assignment involves calculating orbital parameters such as velocity, period, and energy for various types of orbits. You will also analyze perturbations in orbital mechanics."
    },
    { 
        "_id": "A303", 
        "title": "Systems Engineering Exam", 
        "availability": "2024-10-09", 
        "due": "2024-10-30", 
        "points": "100",
        "course": "RS103",
        "description": "The exam will cover core concepts in systems engineering, including system design, lifecycle management, and risk analysis. Make sure to review system integration processes and requirements management."
    }
]
